###################################################################

# Created by write_sdc on Tue Dec 14 01:30:01 2021

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_load -pin_load 0.05 [get_ports out_valid]
set_load -pin_load 0.05 [get_ports {out_x[2]}]
set_load -pin_load 0.05 [get_ports {out_x[1]}]
set_load -pin_load 0.05 [get_ports {out_x[0]}]
set_load -pin_load 0.05 [get_ports {out_y[2]}]
set_load -pin_load 0.05 [get_ports {out_y[1]}]
set_load -pin_load 0.05 [get_ports {out_y[0]}]
set_load -pin_load 0.05 [get_ports {move_out[4]}]
set_load -pin_load 0.05 [get_ports {move_out[3]}]
set_load -pin_load 0.05 [get_ports {move_out[2]}]
set_load -pin_load 0.05 [get_ports {move_out[1]}]
set_load -pin_load 0.05 [get_ports {move_out[0]}]
create_clock [get_ports clk]  -period 10  -waveform {0 5}
set_input_delay -clock clk  0  [get_ports clk]
set_input_delay -clock clk  0  [get_ports rst_n]
set_input_delay -clock clk  5  [get_ports in_valid]
set_input_delay -clock clk  5  [get_ports {in_x[2]}]
set_input_delay -clock clk  5  [get_ports {in_x[1]}]
set_input_delay -clock clk  5  [get_ports {in_x[0]}]
set_input_delay -clock clk  5  [get_ports {in_y[2]}]
set_input_delay -clock clk  5  [get_ports {in_y[1]}]
set_input_delay -clock clk  5  [get_ports {in_y[0]}]
set_input_delay -clock clk  5  [get_ports {move_num[4]}]
set_input_delay -clock clk  5  [get_ports {move_num[3]}]
set_input_delay -clock clk  5  [get_ports {move_num[2]}]
set_input_delay -clock clk  5  [get_ports {move_num[1]}]
set_input_delay -clock clk  5  [get_ports {move_num[0]}]
set_input_delay -clock clk  5  [get_ports {priority_num[2]}]
set_input_delay -clock clk  5  [get_ports {priority_num[1]}]
set_input_delay -clock clk  5  [get_ports {priority_num[0]}]
set_output_delay -clock clk  5  [get_ports out_valid]
set_output_delay -clock clk  5  [get_ports {out_x[2]}]
set_output_delay -clock clk  5  [get_ports {out_x[1]}]
set_output_delay -clock clk  5  [get_ports {out_x[0]}]
set_output_delay -clock clk  5  [get_ports {out_y[2]}]
set_output_delay -clock clk  5  [get_ports {out_y[1]}]
set_output_delay -clock clk  5  [get_ports {out_y[0]}]
set_output_delay -clock clk  5  [get_ports {move_out[4]}]
set_output_delay -clock clk  5  [get_ports {move_out[3]}]
set_output_delay -clock clk  5  [get_ports {move_out[2]}]
set_output_delay -clock clk  5  [get_ports {move_out[1]}]
set_output_delay -clock clk  5  [get_ports {move_out[0]}]
